<?php

return [

    /*
    |--------------------------------------------------------------------------
    | メインの言語ファイル(英語)
    |--------------------------------------------------------------------------
    |
    */
    
    /*
    |--------------------------------------------------------------------------
    | 共通系
    |--------------------------------------------------------------------------
    */
'user_sex' => [
                 '0' => '',
                 '1' => 'ชาย',
                 '2' => 'ผู้หญิง',
                 ], // 性別

    'offer_state'=>['0' => "",
                  '1' => "ขอ",
                  '2' => "รอการอนุมัติแล้ว",
                  '3' => "ได้รับการอนุมัติ"],// オファー状態
    /*
    |--------------------------------------------------------------------------
    | resources/views/auth/login.blade.php
    |--------------------------------------------------------------------------
    */
    'login_sns_login_title' => 'SNS  เข้าสู่ระบบ',
     'login_sns_go' => 'google +  เข้าสู่ระบบ',
     'login_sns_fb' => 'Facebook  เข้าสู่ระบบ',
     'login_sns_tw' => 'twitter  เข้าสู่ระบบ',
     'login_sns_gi' => 'Github  เข้าสู่ระบบ',
     'login_mail_title' => 'เข้าสู่ระบบเมล',
     'login_mail' => 'ที่อยู่อีเมล',
     'login_pass' => 'รหัสผ่าน',
     'login_button_label' => 'เข้าสู่ระบบ',
     'login_forget' => 'ลืมรหัสผ่าน?',
    /*
    |--------------------------------------------------------------------------
    | resources/views/auth/register.blade.php
    |--------------------------------------------------------------------------
    */
    'register_title' => 'ลงทะเบียน',
    'register_name' => 'ชื่อ',
    'register_pass_conf' => 'ยืนยันรหัสผ่าน',
    'register_button_label' => 'ลงทะเบียน',
    /*
    |--------------------------------------------------------------------------
    | resources/views/nav.blade.php
    |--------------------------------------------------------------------------
    */
    'nav_welcome' => 'ยินดีต้อนรับ, :name',
    'nav_lang' => 'ภาษา:',
    'nav_time' => 'เขตเวลา:',
     /*
    |--------------------------------------------------------------------------
    | resources/views/my_schedule.blade.php
    |--------------------------------------------------------------------------
    */
    'schedule_create_button' => 'สร้างตารางเวลาใหม่',
     'schedule_modal_close' => 'ปิด',
     'schedule_modal_title' => 'กำหนดการลงทะเบียน',
     'schedule_modal_date' => 'วันที่',
     'schedule_modal_start' => "เริ่มต้น",
     'schedule_modal_end' => "ท้าย",
     'schedule_modal_content_title' => "เนื้อหา",
     'schedule_modal_content' => "เนื้อหา",
     'schedule_modal_close_button' => "ปิด",
     'schedule_modal_reg_button' => "ลงทะเบียน",
     'schedule_modal_del_button' => "ลบ",
    'schedule_modal_mod_button' => "การแก้ไข",
     'schedule_modal_disp' => 'กำหนดการแสดงผล',
     'schedule_friend_list' => 'รายชื่อเพื่อน',
     'schedule_group_list' => 'กำหนดการจัดกลุ่ม',
     'schedule_modal_share' => 'แชร์',
    /*
    |--------------------------------------------------------------------------
    | resources/views/friend.blade.php
    |--------------------------------------------------------------------------
    */
    'friend_list' => 'รายชื่อเพื่อน',
    'friend_request_list' => 'รายชื่อผู้สมัครเพื่อน',
     'friend_add' => 'เพิ่มเพื่อน',
     'friend_ng_Button' => 'ปฏิเสธ',
     'friend_user_list' => "รายชื่อผู้ใช้",
     'friend_request_Button' => "คำขอ",
     'friend_request_receiving' => "ร้องขอการกู้คืน",
     'friend_request_pending' => "คำขอรอดำเนินการ",
     'friend_request_message' => "ข้อความ",
    /*
    |--------------------------------------------------------------------------
    | resources/views/offer.blade.php
    |--------------------------------------------------------------------------
    */

    'offerCerate' => 'เสนอข้อเสนอ',
     'recOfferList' => 'ข้อเสนอพิเศษ',
     'offerTimeStart' => 'เริ่ม:',
     'offerTimeEnd' => 'End:',
     'offerNgButton' => 'ปฏิเสธ',
     'offerOkButton' => "อนุมัติ",
     'reqOfferList' => 'รายการเสนอข้อเสนอที่รอดำเนินการ',
     'offerCheck' => 'ข้อเสนอพิเศษ',
    /*
    |--------------------------------------------------------------------------
    | resources/views/group.blade.php
    |--------------------------------------------------------------------------
    */
    'group_create_button' => 'สร้างกลุ่มใหม่',
     'group_list' => 'รายชื่อกลุ่ม',
     'group_leave_button' => 'ปล่อย',
     'group_request_list' => 'รายการคำขอกลุ่ม',
     'group_ng_Button' => 'ปฏิเสธ',
     'group_add_Button' => "เข้าร่วม",
     'group_admin' => "ผู้ดูแล:",
     'group_modal_title' => "สร้างกลุ่มใหม่",
     'group_modal_close_button' => "ปิด",
     'group_modal_content' => "เนื้อหา",
     'group_modal_name' => "ชื่อกลุ่ม",
    /*
    |--------------------------------------------------------------------------
    | resources/views/group_schedule.blade.php
    |--------------------------------------------------------------------------
    */
    'gr_sche_cre_button' => 'สร้างตารางเวลาใหม่',
    'gr_user_add_button' => 'เพิ่มผู้ใช้',
    'gr_user_add_title' => 'เพิ่มผู้ใช้',
    'gr_user_list' => 'รายชื่อผู้ใช้กลุ่ม',
    /*
    |--------------------------------------------------------------------------
    | resources/views/setting.blade.php 
    |--------------------------------------------------------------------------
    */
    'setting_title' => 'โปรไฟล์ผู้ใช้',
    /*
    |--------------------------------------------------------------------------
    | resources/views/marge_schedule.blade.php 
    |--------------------------------------------------------------------------
    */
    'marge_schedule' => 'ตารางงานใหญ่',
    'marge' => ' เนยเทียม',
    'my_schedule' => 'กำหนดการของฉัน',
    /*
    |--------------------------------------------------------------------------
    | timezone
    |--------------------------------------------------------------------------
    */    
    'TIME_ZONE_NAME' => [
                        '0' => "ญี่ปุ่น",
                        '1' => "อเมริกา (ฮาวาย)",
                        '2' => "อเมริกา (ลอสแอนเจลิส, ซานฟรานซิสโก, ลาสเวกัส)",
                        '3' => "อเมริกา (ฟินิกซ์, เดนเวอร์, ซอลต์เลกซิตี)",
                        '4' => "อเมริกา (ชิคาโก, ฮุสตัน, ดัลลัส, นิวออร์ลีนส์)",
                        '5' => "อเมริกา (นิวยอร์กบอสตันแอตแลนตาไมอามี)",
                        '6' => "อาร์เจนตินา",
                        '7' => "เอกวาดอร์",
                        '8' => "แคนาดา (แวนคูเวอร์, บริติชโคลัมเบีย)",
                        '9' => "แคนาดา (แบมฟ์, คาลการี, อัลเบอร์ต้า)",
                        '10' => "แคนาดา (แมนิโทบา)",
                        '11' => "แคนาดา (โตรอนโต, ออตตาวา, ออนตาริ)",
                        '12' => "แคนาดา (ควิเบก, มอนทรีออล (ควิเบก))",
                        '13' => "คิวบา",
                        '14' => "กัวเตมาลา",
                        '15' => "จาเมกา",
                        '16' => "ชิลี (แผ่นดินใหญ่ชิลี)",
                        '17' => "ชิลี (เกาะอีสเตอร์)",
                        '18' => "เปรู",
                        '19' => "บราซิล (เซาเปาโล, รีโอเดจาเนโร)",
                        '20' => "เม็กซิโก (เม็กซิโกซิตี้, แคนคูน)",
                        '21' => "อินเดีย",
                        '22' => "อินโดนีเซีย (จาการ์ตา)",
                        '23' => "อินโดนีเซีย (บาหลี)",
                        '24' => "เกาหลีใต้",
                        '25' => "กัมพูชา",
                        '26' => "สิงคโปร์",
                        '27' => "เนปาล",
                        '28' => "ปากีสถาน",
                        '29' => "เวียดนาม",
                        '30' => "ไทย",
                        '31' => "จีน (รวมทั้งฮ่องกงและมาเก๊า)",
                        '32' => "มาเลเซีย",
                        '33' => "มัลดีฟส์",
                        '34' => "ออสเตรเลีย (ซิดนีย์เมลเบิร์นแครนส์บริสเบนโกลด์โคสต์)",
                        '35' => "ออสเตรเลีย(เยอร์หินแอดิเลด)",
                        '36' => "ออสเตรเลีย (เพิร์ ธ )",
                        '37' => "กวม / ไซปัน",
                        '38' => "นิวแคลิโดเนีย",
                        '39' => "นิวซีแลนด์",
                        '40' => "ปาปัวนิวกีนี",
                        '41' => "ปาเลา",
                        '42' => "ฟิจิ",
                        '43' => "ตาฮิติ (เฟรนช์โปลินีเซีย)",
                        '44' => "สหราชอาณาจักร",
                        '45' => "อิตาลี",
                        '46' => "ออสเตรีย",
                        '47' => "เนเธอร์แลนด์",
                        '48' => "กรีซ",
                        '49' => "โครเอเชีย",
                        '50' => "ประเทศสวิสเซอร์แลนด์",
                        '51' => "สวีเดน",
                        '52' => "สเปน",
                        '53' => "สโลวาเกีย",
                        '54' => "สโลวีเนีย",
                        '55' => "เช็ก",
                        '56' => "เดนมาร์ก",
                        '57' => "เยอรมนี",
                        '58' => "นอร์เวย์",
                        '59' => "ฮังการี",
                        '60' => "ฟินแลนด์",
                        '61' => "ฝรั่งเศส",
                        '62' => "เบลเยียม",
                        '63' => "โปแลนด์",
                        '64' => "โปรตุเกส",
                        '65' => "มอลตา",
                        '66' => "โมนาโก",
                        '67' => "นสไตน์",
                        '68' => "ลักเซมเบิร์ก",
                        '69' => "รัสเซีย (มอสโก, เซนต์ปีเตอร์สเบิร์ก, โซซี)",
                        '70' => "รัสเซีย (Khabarovsk, Vladivostok)",
                        '71' => "สหรัฐอาหรับเอมิเรตส์ (ดูไบ)",
                        '72' => "อิสราเอล",
                        '73' => "อิหร่าน",
                        '74' => "อียิปต์",
                        '75' => "ซาอุดีอาระเบีย",
                        '76' => "ซีเรีย",
                        '77' => "ตูนิเซีย",
                        '78' => "ตุรกี",
                        '79' => "แอฟริกาใต้",
                        '80' => "โมร็อกโก"
                          ],
];
