<?php

return [

    /*
    |--------------------------------------------------------------------------
    | メインの言語ファイル
    |--------------------------------------------------------------------------
    |
    */
    /*
    |--------------------------------------------------------------------------
    | 共通系
    |--------------------------------------------------------------------------
    */
    'user_sex' => [
                    '0' => '',
                    '1' => '男性',
                    '2' => '女性',
                    ],         // 性別

    'offer_state'=>['0' => "",
                  '1' => "申請中",
                  '2' => "承認待ち",
                  '3' => "承認済み"],// オファー状態
                  
    /*
    |--------------------------------------------------------------------------
    | resources/views/auth/login.blade.php
    |--------------------------------------------------------------------------
    */
    'login_sns_login_title' => ' SNSログイン',
    'login_sns_go' => ' google+ アカウントでログイン　　　',
    'login_sns_fb' => ' Facebook アカウントでログイン 　　',
    'login_sns_tw' => ' Twitterアカウントでログイン　　　　',
    'login_sns_gi' => ' Githubアカウントでログイン　　　　',
    'login_mail_title' => ' メールアドレスログイン',
    'login_mail' => 'E-Mail アドレス',
    'login_pass' => 'パスワード',
    'login_button_label' => 'ログイン',
    'login_forget' => 'パスワードをお忘れですか?',
    /*
    |--------------------------------------------------------------------------
    | resources/views/auth/register.blade.php
    |--------------------------------------------------------------------------
    */
    'register_title' => ' 新規登録',
    'register_name' => '名前',
    'register_pass_conf' => 'パスワード確認',
    'register_button_label' => ' 新規登録',
    /*
    |--------------------------------------------------------------------------
    | resources/views/nav.blade.php
    |--------------------------------------------------------------------------
    */
    'nav_welcome' => 'ようこそ:nameさん',
    'nav_lang' => '言語:',
    'nav_time' => 'タイムゾーン:',
    /*
    |--------------------------------------------------------------------------
    | resources/views/my_schedule.blade.php
    |--------------------------------------------------------------------------
    */
    'schedule_create_button' => ' スケジュール新規作成',
    'schedule_modal_close' => '閉じる',
    'schedule_modal_title' => 'スケジュール登録',
    'schedule_modal_date' => '日時',
    'schedule_modal_start' => "開始",
    'schedule_modal_end' => " 終了",
    'schedule_modal_content_title' => "内容", 
    'schedule_modal_content' => "内容",        
    'schedule_modal_close_button' => "閉じる", 
    'schedule_modal_reg_button' => "登録",
    'schedule_modal_disp' => 'スケジュール表示',
    'schedule_friend_list' => '友達スケジュール',
    'schedule_group_list' => 'グループスケジュール',
    'schedule_modal_share' => '取り込む',
    /*
    |--------------------------------------------------------------------------
    | resources/views/friend.blade.php
    |--------------------------------------------------------------------------
    */
    'friend_list' => '友達一覧',
    'friend_request_list' => '友達申請一覧',
    'friend_add' => ' 友達追加',
    'friend_ng_Button' => ' 拒否',
    'friend_user_list' => "ユーザー一覧",
    'friend_request_Button' => " 友達リクエスト",
    'friend_request_receiving' => " リクエスト受信中", 
    'friend_request_pending' => " リクエスト申請中",
    'friend_request_message' => "メッセージ",
    /*
    |--------------------------------------------------------------------------
    | resources/views/offer.blade.php
    |--------------------------------------------------------------------------
    */
    'offerCerate' => ' オファー作成',
    'recOfferList' => '受領オファー一覧',
    'offerTimeStart' => '開始：',
    'offerTimeEnd' => '終了：',
    'offerNgButton' => " 拒否",
    'offerOkButton' => " 承認",
    'reqOfferList' => "申請中オファー一覧",
    'offerCheck' => "オファー",
    /*
    |--------------------------------------------------------------------------
    | resources/views/group.blade.php
    |--------------------------------------------------------------------------
    */
    'group_create_button' => ' グループ新規作成',
    'group_list' => 'グループ一覧',
    'group_leave_button' => ' 退会',
    'group_request_list' => 'グループ申請一覧',
    'group_ng_Button' => ' 拒否',
    'group_add_Button' => " グループ参加",
    'group_admin' => "管理者：",
    'group_modal_title' => "グループ新規作成",
    'group_modal_close_button' => "閉じる", 
    'group_modal_content' => "内容",
    'group_modal_name' => "グループ名", 
    /*
    |--------------------------------------------------------------------------
    | resources/views/group_schedule.blade.php
    |--------------------------------------------------------------------------
    */
    'gr_sche_cre_button' => ' スケジュール新規作成',
    'gr_user_add_button' => ' ユーザー招待',
    'gr_user_add_title' => 'ユーザー招待',
    'gr_user_list' => 'グループユーザーリスト',
    /*
    |--------------------------------------------------------------------------
    | resources/views/setting.blade.php 
    |--------------------------------------------------------------------------
    */
    'setting_title' => 'ユーザープロフィール',
    /*
    |--------------------------------------------------------------------------
    | resources/views/marge_schedule.blade.php 
    |--------------------------------------------------------------------------
    */
    'marge_schedule' => 'マージスケジュール',
    'marge' => ' マージ',
    'my_schedule' => 'マイスケジュール',
    /*
    |--------------------------------------------------------------------------
    | timezone
    |--------------------------------------------------------------------------
    */    
    'TIME_ZONE_NAME' => [
                        '0' => "日本",
                        '1' => "アメリカ(ハワイ)",
                        '2' => "アメリカ(ロサンゼルス、サンフランシスコ、ラスベガス)",
                        '3' => "アメリカ(フェニックス、デンバー、ソルトレイクシティ)",
                        '4' => "アメリカ(シカゴ、ヒューストン、ダラス、ニューオリンズ)",
                        '5' => "アメリカ(ニューヨーク、ボストン、アトランタ、マイアミ)",
                        '6' => "アルゼンチン",
                        '7' => "エクアドル",
                        '8' => "カナダ(バンクーバー(ブリティッシュ・コロンビア州))",
                        '9' => "カナダ(バンフ、カルガリー(アルバータ州))",
                        '10' => "カナダ(ウィニペグ(マニトバ州))",
                        '11' => "カナダ(トロント、オタワ(オンタリオ州))",
                        '12' => "カナダ(ケベック、モントリオール(ケベック州))",
                        '13' => "キューバ",
                        '14' => "グアテマラ",
                        '15' => "ジャマイカ",
                        '16' => "チリ(チリ本土)",
                        '17' => "チリ(イースター島)",
                        '18' => "ペルー",
                        '19' => "ブラジル（サン・パウロ、リオ・デ・ジャネイロ）",
                        '20' => "メキシコ（メキシコシティ、カンクン）",
                        '21' => "インド",
                        '22' => "インドネシア(ジャカルタ)",
                        '23' => "インドネシア(バリ島)",
                        '24' => "韓国",
                        '25' => "カンボジア",
                        '26' => "シンガポール",
                        '27' => "ネパール",
                        '28' => "パキスタン",
                        '29' => "ベトナム",
                        '30' => "タイ",
                        '31' => "中国(香港、マカオ を含む)",
                        '32' => "マレーシア",
                        '33' => "モルジブ",
                        '34' => "オーストラリア(シドニー、メルボルン、ケアンズ、ブリスベン、ゴールド・コースト)",
                        '35' => "オーストラリア(エアーズロック、アデレード)",
                        '36' => "オーストラリア(パース）",
                        '37' => "グアム・サイパン",
                        '38' => "ニューカレドニア",
                        '39' => "ニュージーランド",
                        '40' => "パプアニューギニア",
                        '41' => "パラオ",
                        '42' => "フィジー",
                        '43' => "タヒチ(フランス領ポリネシア)",
                        '44' => "イギリス",
                        '45' => "イタリア",
                        '46' => "オーストリア",
                        '47' => "オランダ",
                        '48' => "ギリシャ",
                        '49' => "クロアチア",
                        '50' => "スイス",
                        '51' => "スウェーデン",
                        '52' => "スぺイン",
                        '53' => "スロバキア",
                        '54' => "スロベニア",
                        '55' => "チェコ",
                        '56' => "デンマーク",
                        '57' => "ドイツ",
                        '58' => "ノルウェー",
                        '59' => "ハンガリー",
                        '60' => "フィンランド",
                        '61' => "フランス",
                        '62' => "ベルギー",
                        '63' => "ポーランド",
                        '64' => "ポルトガル",
                        '65' => "マルタ",
                        '66' => "モナコ",
                        '67' => "リヒテンシュタイン",
                        '68' => "ルクセンブルク",
                        '69' => "ロシア(モスクワ、サンクトペテルブルグ、ソチ)",
                        '70' => "ロシア(ハバロフスク、ウラジオストック)",
                        '71' => "アラブ首長国連邦(ドバイ)",
                        '72' => "イスラエル",
                        '73' => "イラン",
                        '74' => "エジプト",
                        '75' => "サウジアラビア",
                        '76' => "シリア",
                        '77' => "チュニジア",
                        '78' => "トルコ",
                        '79' => "南アフリカ",
                        '80' => "モロッコ"
                          ],
];
